package com.example.ettaki;

public class Questions {

    public static String question[] = {
            "هل تواجه أي خلل في الوظيفية؟ على سبيل المثال: نقص في القوة الجسدية أو العضلية، مثل الشعور بالحاجة إلى بذل جهد لتحريك ذراعك أو عسر في البلع أو عسر الكلام.",
            "هل تواجه أي إعاقة من هذه النظم الوظيفية؟ على سبيل المثال: عدم قدرتك على أداء بعض الأنشطة واعتمادك على الآخرين للقيام بها.",
            "هل لديك القدرة على المشي؟",
            "هل تستعمل أي أداة لمساعدتك على المشي مثل العكاز؟",
            "ما مدى شدة هذه الإعاقة؟ (بناءً على تشخيص الطبيب)",
            "كم من الوقت يمكنك المشي بدون مساعدة؟",
            "كيف هي طبيعة يومك؟"
    };

    public static String choices[][] = {
            {"نعم", "لا" },
            {"نعم", "لا" },
            {"نعم", "لا" },
            {"نعم", "لا" },
            {"إعاقة خفيفة", "إعاقة متوسطة", "إعاقة شديدة", "ليس لدي أي منها" },
            {"من 0 إلى 100 م", "من 100 إلى 200 م", "من 360 فأكثر" },
            {"في كرسي متحرك","محصورة في السرير","بين الكرسي والسرير", "لا شي مما ذكر"}

    };
}
